app/Controllers/CrudController.php

        } else if ($keterangan == 'get_temuan_by_id') { # function untuk mengambil data temuan patrol based on id_temuan
            $id_temuan = $this->request->getPost('id_temuan');
            # ambil data temuan patrol berdasarkan id_temuan_patrol dan join tabel departement dan section
            $temuan = $this->dataPatrol->db->table('dt_temuan_patrol')
                ->select('
        dt_temuan_patrol.*,
        d.departement AS departement_name,
        s.section AS section_name,
        pic_dept.departement AS pic_departement_name,
        pic_sec.section AS pic_section_name
    ')
                ->join('henkaten_assy_dev.dbo.departement d', 'dt_temuan_patrol.id_departement = d.id_departement', 'left')
                ->join('henkaten_assy_dev.dbo.section s', 'dt_temuan_patrol.id_section = s.id_section', 'left')
                ->join('henkaten_assy_dev.dbo.departement AS pic_dept', 'dt_temuan_patrol.pic_action_departement_id = pic_dept.id_departement', 'left')
                ->join('henkaten_assy_dev.dbo.section AS pic_sec', 'dt_temuan_patrol.pic_action_section_id = pic_sec.id_section', 'left')
                ->where('dt_temuan_patrol.id_temuan_patrol', $id_temuan)
                ->get()
                ->getRowArray();
---
SELECT "dt_temuan_patrol".*, "d"."departement" AS "departement_name", "s"."section" AS "section_name", "pic_dept"."departement" AS "pic_departement_name", "pic_sec"."section" AS "pic_section_name"
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" "d" ON "dt_temuan_patrol"."id_departement" = "d"."id_departement"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" "s" ON "dt_temuan_patrol"."id_section" = "s"."id_section"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" AS "pic_dept" ON "dt_temuan_patrol"."pic_action_departement_id" = "pic_dept"."id_departement"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" AS "pic_sec" ON "dt_temuan_patrol"."pic_action_section_id" = "pic_sec"."id_section"
WHERE "dt_temuan_patrol"."id_temuan_patrol" = '25'

        } else if ($keterangan == 'get_temuan_auditee_by_id') {
            $id_temuan = $this->request->getPost('id_temuan');
            # ambil data temuan patrol berdasarkan id_temuan_patrol dan join tabel departement dan section
            $temuan = $this->dataPatrol->db->table('dt_temuan_patrol')
                ->select('
        dt_temuan_patrol.*,
        d.departement AS departement_name,
        s.section AS section_name,
        pic_dept.departement AS pic_departement_name,
        pic_sec.section AS pic_section_name
    ')
                ->join('henkaten_assy_dev.dbo.departement d', 'dt_temuan_patrol.id_departement = d.id_departement', 'left')
                ->join('henkaten_assy_dev.dbo.section s', 'dt_temuan_patrol.id_section = s.id_section', 'left')
                ->join('henkaten_assy_dev.dbo.departement AS pic_dept', 'dt_temuan_patrol.pic_action_departement_id = pic_dept.id_departement', 'left')
                ->join('henkaten_assy_dev.dbo.section AS pic_sec', 'dt_temuan_patrol.pic_action_section_id = pic_sec.id_section', 'left')
                ->where('dt_temuan_patrol.id_temuan_patrol', $id_temuan)
                ->get()
                ->getRowArray();
---
SELECT "dt_temuan_patrol".*, "d"."departement" AS "departement_name", "s"."section" AS "section_name", "pic_dept"."departement" AS "pic_departement_name", "pic_sec"."section" AS "pic_section_name"
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" "d" ON "dt_temuan_patrol"."id_departement" = "d"."id_departement"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" "s" ON "dt_temuan_patrol"."id_section" = "s"."id_section"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" AS "pic_dept" ON "dt_temuan_patrol"."pic_action_departement_id" = "pic_dept"."id_departement"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" AS "pic_sec" ON "dt_temuan_patrol"."pic_action_section_id" = "pic_sec"."id_section"
WHERE "dt_temuan_patrol"."id_temuan_patrol" = '16'