app/Models/Model_data_patrol.php

SELECT "dt_temuan_patrol".*, "departement"."departement" AS "departement_name", "section"."section" AS "section_name", "pic_dept"."departement" AS "pic_departement_name", "pic_sec"."section" AS "pic_section_name"
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "new_quality_patrol"."dbo"."departement" ON "dt_temuan_patrol"."id_departement" = "departement"."id_departement"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "dt_temuan_patrol"."id_section" = "section"."id_section"
LEFT JOIN "new_quality_patrol"."dbo"."departement" AS "pic_dept" ON "dt_temuan_patrol"."pic_action_departement_id" = "pic_dept"."id_departement"
LEFT JOIN "new_quality_patrol"."dbo"."section" AS "pic_sec" ON "dt_temuan_patrol"."pic_action_section_id" = "pic_sec"."id_section"
---
    public function get_data_patrolAll()
    {
        # ambil semua data dari tabel dt_temuan_patrol dan join id_dept dan id_seksi untuk menampilkan nama departemen dan nama seksi
        return $this->db->table('dt_temuan_patrol')
            ->select('
        dt_temuan_patrol.*,
        d.departement AS departement_name,
        s.section AS section_name,
        pic_dept.departement AS pic_departement_name,
        pic_sec.section AS pic_section_name
    ')
            ->join('henkaten_assy_dev.dbo.departement d', 'dt_temuan_patrol.id_departement = d.id_departement', 'left')
            ->join('henkaten_assy_dev.dbo.section s', 'dt_temuan_patrol.id_section = s.id_section', 'left')
            ->join('henkaten_assy_dev.dbo.departement AS pic_dept', 'dt_temuan_patrol.pic_action_departement_id = pic_dept.id_departement', 'left')
            ->join('henkaten_assy_dev.dbo.section AS pic_sec', 'dt_temuan_patrol.pic_action_section_id = pic_sec.id_section', 'left')
            ->get()
            ->getResultArray();

SELECT "users"."id" AS "user_id", "master_data_karyawan"."id" AS "karyawan_id", "users"."npk", "users"."role", "master_data_karyawan"."nama"
FROM "db_quality_patrol"."dbo"."users"
LEFT JOIN "db_quality_patrol"."dbo"."master_data_karyawan" ON "users"."npk" = "master_data_karyawan"."npk"
WHERE "users"."role" = 3
---
    public function getAlldata_user()
    {
        return $this->db
            ->table('new_quality_patrol.dbo.users u')
            ->select('u.id as user_id, u.npk, u.role, m.nama, m.id_departement, m.id_section')
            ->join('henkaten_assy_dev.dbo.master_data_karyawan m', 'u.npk = m.npk', 'left')
            ->get()
            ->getResultArray();

SELECT *
FROM "henkaten_assy_dev"."dbo"."section"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" ON "section"."id_departement" = "departement"."id_departement"
WHERE "id_section" = '60'
---
    public function getSection_andDeptByID($id_section)
    {
        return $this->henkaten->table('section')
            ->join('henkaten_assy_dev.dbo.departement', 'section.id_departement = departement.id_departement', 'left')
            ->where('id_section', $id_section)
            ->get()
            ->getRowArray();

SELECT dt_temuan_patrol.id_section,
        departement.departement AS nama_departemen,
        section.section AS nama_section,
        SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_count,
        COUNT(*) AS total
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "new_quality_patrol"."dbo"."departement" ON "departement"."id_departement" = "dt_temuan_patrol"."id_departement"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "section"."id_section" = "dt_temuan_patrol"."id_section"
WHERE CONVERT(date, dt_temuan_patrol.tanggal_patrol, 106) >= CONVERT(date, '11 Dec 2025', 106)
AND CONVERT(date, dt_temuan_patrol.tanggal_patrol, 106) <= CONVERT(date, '11 Dec 2025', 106)
GROUP BY "dt_temuan_patrol"."id_section", "departement"."departement", "section"."section"
---
    public function filterRangeDate($startDate, $endDate)
    {
        return $this->db->table('dt_temuan_patrol')
            ->select("
        dt_temuan_patrol.id_section,
        departement.departement AS nama_departemen,
        section.section AS nama_section,
        SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_count,
        SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_count,
        COUNT(*) AS total
    ", false)
            ->join('henkaten_assy_dev.dbo.departement departement', 'departement.id_departement = dt_temuan_patrol.id_departement', 'left')
            ->join('henkaten_assy_dev.dbo.section section', 'section.id_section = dt_temuan_patrol.id_section', 'left')
            ->where("CONVERT(date, dt_temuan_patrol.tanggal_patrol, 106) >=", "CONVERT(date, '{$startDate}', 106)", false)
            ->where("CONVERT(date, dt_temuan_patrol.tanggal_patrol, 106) <=", "CONVERT(date, '{$endDate}', 106)", false)
            ->groupBy([
                'dt_temuan_patrol.id_section',
                'departement.departement',
                'section.section'
            ])
            ->get()
            ->getResultArray();

SELECT "dt_temuan_patrol"."id_departement", "dt_temuan_patrol"."status", MONTH(tanggal_patrol) AS bulan, SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_total, SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_total, SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_total, SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_total, COUNT(*) AS total
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "section"."id_section" = "dt_temuan_patrol"."id_section"
WHERE "dt_temuan_patrol"."id_departement" = '25'
AND YEAR(tanggal_patrol) = '2026'
GROUP BY MONTH(tanggal_patrol), "dt_temuan_patrol"."id_departement", "dt_temuan_patrol"."status"
---
    public function filterDept($idDept)
    {

        return $this->db->table('dt_temuan_patrol')
            ->select("
    dt_temuan_patrol.id_departement,
    dt_temuan_patrol.status,
    MONTH(tanggal_patrol) AS bulan,
    SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_total,
    SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_total,
    SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_total,
    SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_total,

     COUNT(*) AS total
    ")
            ->join('henkaten_assy_dev.dbo.section section', 'section.id_section = dt_temuan_patrol.id_section', 'left')
            ->where('dt_temuan_patrol.id_departement', $idDept)

            ->groupBy([

                'MONTH(tanggal_patrol)',
                ' dt_temuan_patrol.id_departement',
                'dt_temuan_patrol.status'

            ])
            ->get()
            ->getResultArray();

SELECT SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_total, SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_total, SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_total, SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_total
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "section"."id_section" = "dt_temuan_patrol"."id_section"
WHERE "dt_temuan_patrol"."id_departement" = '25'
AND YEAR(tanggal_patrol) = '2026'
---
    public function filterDept2($idDept)
    {

        return $this->db->table('dt_temuan_patrol')
            ->select("
     SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS open_total,
            SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS progress_total,
            SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS close_total,
            SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS cancel_total,
    ")
            ->join('henkaten_assy_dev.dbo.section section', 'section.id_section = dt_temuan_patrol.id_section', 'left')
            ->where('dt_temuan_patrol.id_departement', $idDept)

SELECT "dt_temuan_patrol"."id_section", "departement"."departement" AS "nama_departemen", "section"."section" AS "nama_section", -- COUNT per status numeric
            SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS total_open, SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS total_progress, SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS total_close, SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS total_cancel, COUNT(dt_temuan_patrol.id_temuan_patrol) AS total_temuan
FROM "new_quality_patrol"."dbo"."dt_temuan_patrol"
LEFT JOIN "new_quality_patrol"."dbo"."departement" ON "departement"."id_departement" = "dt_temuan_patrol"."id_departement"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "section"."id_section" = "dt_temuan_patrol"."id_section"
GROUP BY "dt_temuan_patrol"."id_section", "departement"."departement", "section"."section"
---
    public function totalTemuanByArea()
    {

        return $this->db->table('dt_temuan_patrol')
            ->select("
            dt_temuan_patrol.id_section,
            d.departement AS nama_departemen,
            s.section AS nama_section,

            -- COUNT per status numeric
            SUM(CASE WHEN dt_temuan_patrol.status = 3 THEN 1 ELSE 0 END) AS total_open,
            SUM(CASE WHEN dt_temuan_patrol.status = 2 THEN 1 ELSE 0 END) AS total_progress,
            SUM(CASE WHEN dt_temuan_patrol.status = 1 THEN 1 ELSE 0 END) AS total_close,
            SUM(CASE WHEN dt_temuan_patrol.status = 4 THEN 1 ELSE 0 END) AS total_cancel,

            COUNT(dt_temuan_patrol.id_temuan_patrol) AS total_temuan
        ")
            ->join('henkaten_assy_dev.dbo.departement d', 'd.id_departement = dt_temuan_patrol.id_departement', 'left')
            ->join('henkaten_assy_dev.dbo.section s', 's.id_section = dt_temuan_patrol.id_section', 'left')

            ->groupBy([
                'dt_temuan_patrol.id_section',
                'd.departement',
                's.section'
            ])
            ->get()
            ->getResultArray();

SELECT "s"."section" AS "section_name", "d"."departement" AS "departement_name", "dt_schedule"."tanggal_patrol", "dt_schedule"."id_schedule", "dt_schedule"."tanggal_actual"
FROM "new_quality_patrol"."dbo"."dt_schedule"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" "d" ON "d"."id_departement" = "dt_schedule"."id_dept"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" "s" ON "s"."id_section" = "dt_schedule"."id_section"
WHERE "dt_schedule"."id_dept" != 30
AND "dt_schedule"."id_section" != 63
---
    public function get_Alldata_schedule($id_section, $id_dept)
    {
        return $this->db->table('dt_schedule')
            ->select("
        s.section AS section_name,
        d.departement AS departement_name,
        dt_schedule.tanggal_patrol,
        dt_schedule.id_schedule,
        dt_schedule.tanggal_actual
    ")
            ->join('henkaten_assy_dev.dbo.departement d', 'd.id_departement = dt_schedule.id_dept', 'left')
            ->join('henkaten_assy_dev.dbo.section s', 's.id_section = dt_schedule.id_section', 'left')
            ->where('dt_schedule.id_dept !=', $id_dept)
            ->where('dt_schedule.id_section !=', $id_section)
            ->get()
            ->getResultArray();

SELECT "s"."section", "d"."departement", "dt_schedule"."tanggal_patrol", "dt_schedule"."id_schedule", "dt_schedule"."tanggal_actual", STRING_AGG(m.nama, ', ') AS nama_auditor
FROM "new_quality_patrol"."dbo"."dt_schedule"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" "d" ON "d"."id_departement" = "dt_schedule"."id_dept"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" "s" ON "s"."id_section" = "dt_schedule"."id_section"
LEFT JOIN "new_quality_patrol"."dbo"."dt_daftar_hadir" ON "dt_daftar_hadir"."id_schedule" = "dt_schedule"."id_schedule"
LEFT JOIN "henkaten_assy_dev"."dbo"."master_data_karyawan" "m" ON "m"."npk" = "dt_daftar_hadir"."npk"
WHERE "dt_daftar_hadir"."type_data" = 'plan'
GROUP BY "s"."section", "d"."departement", "dt_schedule"."tanggal_patrol", "dt_schedule"."id_schedule", "dt_schedule"."tanggal_actual"
---
    public function get_Alldata_scheduleByUser()
    {
        return $this->db->table('dt_schedule')
            ->select("
            s.section,
            d.departement,
            dt_schedule.tanggal_patrol,
            dt_schedule.id_schedule,
            dt_schedule.tanggal_actual,
            STRING_AGG(m.nama, ', ') AS nama_auditor
        ")
            ->join('henkaten_assy_dev.dbo.departement d', 'd.id_departement = dt_schedule.id_dept', 'left')
            ->join('henkaten_assy_dev.dbo.section s', 's.id_section = dt_schedule.id_section', 'left')
            ->join('dt_daftar_hadir', 'dt_daftar_hadir.id_schedule = dt_schedule.id_schedule', 'left')
            ->join('henkaten_assy_dev.dbo.master_data_karyawan m', 'm.npk = dt_daftar_hadir.npk', 'left')

            ->where('dt_daftar_hadir.type_data', 'plan')
            ->groupBy("
            s.section,
            d.departement,
            dt_schedule.tanggal_patrol,
            dt_schedule.id_schedule,
            dt_schedule.tanggal_actual
        ")
            ->get()
            ->getResultArray();

SELECT "section"."section", "departement"."departement", "dt_schedule"."tanggal_patrol", "dt_schedule"."id_schedule", "dt_schedule"."tanggal_actual"
FROM "new_quality_patrol"."dbo"."dt_schedule"
LEFT JOIN "new_quality_patrol"."dbo"."departement" ON "departement"."id_departement" = "dt_schedule"."id_dept"
LEFT JOIN "new_quality_patrol"."dbo"."section" ON "section"."id_section" = "dt_schedule"."id_section"
WHERE "dt_schedule"."id_dept" != 25
AND "dt_schedule"."id_section" != 66
SELECT "s"."section", "d"."departement", "dt_schedule"."tanggal_patrol", "dt_schedule"."id_schedule", "dt_schedule"."tanggal_actual", "m"."nama" AS "nama_auditor"
FROM "new_quality_patrol"."dbo"."dt_schedule"
LEFT JOIN "henkaten_assy_dev"."dbo"."departement" "d" ON "d"."id_departement" = "dt_schedule"."id_dept"
LEFT JOIN "henkaten_assy_dev"."dbo"."section" "s" ON "s"."id_section" = "dt_schedule"."id_section"
LEFT JOIN "new_quality_patrol"."dbo"."dt_daftar_hadir" ON "dt_daftar_hadir"."id_schedule" = "dt_schedule"."id_schedule"
LEFT JOIN "henkaten_assy_dev"."dbo"."master_data_karyawan" "m" ON "m"."npk" = "dt_daftar_hadir"."npk"
WHERE "dt_schedule"."id_section" = 60
OR "dt_schedule"."id_dept" = 25
---
    public function get_Alldata_scheduleByAuditee($id_section, $id_departement)
    {

        return $this->db->table('dt_schedule')
            ->select("
        s.section,
        d.departement,
        dt_schedule.tanggal_patrol,
        dt_schedule.id_schedule,
        dt_schedule.tanggal_actual,
        m.nama AS nama_auditor
    ")
            ->join('henkaten_assy_dev.dbo.departement d', 'd.id_departement = dt_schedule.id_dept', 'left')
            ->join('henkaten_assy_dev.dbo.section s', 's.id_section = dt_schedule.id_section', 'left')
            // ->join('users', 'users.id = dt_schedule.id_auditor', 'left')
            ->join('dt_daftar_hadir', 'dt_daftar_hadir.id_schedule = dt_schedule.id_schedule', 'left')
            ->join('henkaten_assy_dev.dbo.master_data_karyawan m', 'm.npk = dt_daftar_hadir.npk', 'left')
            ->where('dt_schedule.id_section', $id_section)

            ->orWhere('dt_schedule.id_dept', $id_departement)
            ->get()
            ->getResultArray();